neroroxxx/avr/boards.txt
# This is a modified file for boards for use with BMC
# Only use this boards with the BMC library
# BadassMIDI.com

# Solution for Arduino IDE 2.0 recognizing changes to this file:
# https://github.com/arduino/arduino-ide/issues/1030#issuecomment-1152005617

menu.usb=USB Type
menu.speed=CPU Speed
menu.opt=Optimize
menu.keys=Keyboard Layout


# TODO: consider whether these compiler warnings are worthwhile
# -Wno-error=unused-function
# -Wno-error=unused-but-set-variable
# -Wno-error=unused-variable
# -Wno-unused-parameter
# -Wno-unused-but-set-parameter
# -Wno-sign-compare


bmc_teensy41.name=Teensy 4.1 (BMC)
#bmc_teensy41.upload.maximum_size=8126464
bmc_teensy41.build.board=TEENSY41
bmc_teensy41.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_t41.ld"
#bmc_teensy41.upload.maximum_data_size=524288
bmc_teensy41.upload.tool=teensy:teensyloader
bmc_teensy41.upload.tool.default=teensy:teensyloader
bmc_teensy41.upload.tool.teensy=teensy:teensyloader
bmc_teensy41.upload.protocol=teensy
bmc_teensy41.upload_port.modelID=0x25
bmc_teensy41.build.core=teensy:teensy4
bmc_teensy41.build.mcu=imxrt1062
bmc_teensy41.build.warn_data_percentage=99
bmc_teensy41.build.toolchain=arm/bin/
bmc_teensy41.build.command.gcc=arm-none-eabi-gcc
bmc_teensy41.build.command.g++=arm-none-eabi-g++
bmc_teensy41.build.command.ar=arm-none-eabi-gcc-ar
bmc_teensy41.build.command.objcopy=arm-none-eabi-objcopy
bmc_teensy41.build.command.objdump=arm-none-eabi-objdump
bmc_teensy41.build.command.linker=arm-none-eabi-gcc
bmc_teensy41.build.command.size=arm-none-eabi-size
bmc_teensy41.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
bmc_teensy41.build.flags.dep=-MMD
bmc_teensy41.build.flags.optimize=-Os
bmc_teensy41.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
bmc_teensy41.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159
bmc_teensy41.build.flags.cpp=-std=gnu++17 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing -include "{build.source.path}/config.h"
bmc_teensy41.build.flags.c=
bmc_teensy41.build.flags.S=-x assembler-with-cpp
bmc_teensy41.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
bmc_teensy41.serial.restart_cmd=false
bmc_teensy41.menu.usb.midi=MIDI
bmc_teensy41.menu.usb.midi.build.usbtype=USB_MIDI
bmc_teensy41.menu.usb.midi.upload_port.usbtype=USB_MIDI
bmc_teensy41.menu.usb.midi.fake_serial=teensy_gateway
bmc_teensy41.menu.usb.midi4=MIDIx4
bmc_teensy41.menu.usb.midi4.build.usbtype=USB_MIDI4
bmc_teensy41.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
bmc_teensy41.menu.usb.midi4.fake_serial=teensy_gateway
bmc_teensy41.menu.usb.midi16=MIDIx16
bmc_teensy41.menu.usb.midi16.build.usbtype=USB_MIDI16
bmc_teensy41.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
bmc_teensy41.menu.usb.midi16.fake_serial=teensy_gateway
bmc_teensy41.menu.usb.serialmidi=Serial + MIDI
bmc_teensy41.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
bmc_teensy41.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
bmc_teensy41.menu.usb.serialmidi4=Serial + MIDIx4
bmc_teensy41.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
bmc_teensy41.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
bmc_teensy41.menu.usb.serialmidi16=Serial + MIDIx16
bmc_teensy41.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
bmc_teensy41.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
bmc_teensy41.menu.usb.serialmidiaudio=Serial + MIDI + Audio
bmc_teensy41.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensy41.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensy41.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
bmc_teensy41.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
bmc_teensy41.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL

bmc_teensy41.menu.speed.600=600 MHz
bmc_teensy41.menu.speed.528=528 MHz
bmc_teensy41.menu.speed.450=450 MHz
bmc_teensy41.menu.speed.396=396 MHz
bmc_teensy41.menu.speed.150=150 MHz
bmc_teensy41.menu.speed.24=24 MHz
bmc_teensy41.menu.speed.720=720 MHz (overclock)
bmc_teensy41.menu.speed.816=816 MHz (overclock)
bmc_teensy41.menu.speed.912=912 MHz (overclock, cooling req'd)
bmc_teensy41.menu.speed.960=960 MHz (overclock, cooling req'd)
bmc_teensy41.menu.speed.1008=1.008 GHz (overclock, cooling req'd)
bmc_teensy41.menu.speed.1008.build.fcpu=1008000000
bmc_teensy41.menu.speed.960.build.fcpu=960000000
bmc_teensy41.menu.speed.912.build.fcpu=912000000
bmc_teensy41.menu.speed.816.build.fcpu=816000000
bmc_teensy41.menu.speed.720.build.fcpu=720000000
bmc_teensy41.menu.speed.600.build.fcpu=600000000
bmc_teensy41.menu.speed.528.build.fcpu=528000000
bmc_teensy41.menu.speed.450.build.fcpu=450000000
bmc_teensy41.menu.speed.396.build.fcpu=396000000
bmc_teensy41.menu.speed.150.build.fcpu=150000000
bmc_teensy41.menu.speed.24.build.fcpu=24000000

bmc_teensy41.menu.opt.o2std=Faster
bmc_teensy41.menu.opt.o2std.build.flags.optimize=-O2
bmc_teensy41.menu.opt.o2std.build.flags.ldspecs=
bmc_teensy41.menu.opt.o2lto=Faster with LTO
bmc_teensy41.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
bmc_teensy41.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy41.menu.opt.o1std=Fast
bmc_teensy41.menu.opt.o1std.build.flags.optimize=-O1
bmc_teensy41.menu.opt.o1std.build.flags.ldspecs=
bmc_teensy41.menu.opt.o1lto=Fast with LTO
bmc_teensy41.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
bmc_teensy41.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy41.menu.opt.o3std=Fastest
bmc_teensy41.menu.opt.o3std.build.flags.optimize=-O3
bmc_teensy41.menu.opt.o3std.build.flags.ldspecs=
#bmc_teensy41.menu.opt.o3purestd=Fastest + pure-code
#bmc_teensy41.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#bmc_teensy41.menu.opt.o3purestd.build.flags.ldspecs=
bmc_teensy41.menu.opt.o3lto=Fastest with LTO
bmc_teensy41.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
bmc_teensy41.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#bmc_teensy41.menu.opt.o3purelto=Fastest + pure-code with LTO
#bmc_teensy41.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#bmc_teensy41.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy41.menu.opt.ogstd=Debug
bmc_teensy41.menu.opt.ogstd.build.flags.optimize=-Og
bmc_teensy41.menu.opt.ogstd.build.flags.ldspecs=
#bmc_teensy41.menu.opt.oglto=Debug with LTO
#bmc_teensy41.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#bmc_teensy41.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy41.menu.opt.osstd=Smallest Code
bmc_teensy41.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
bmc_teensy41.menu.opt.osstd.build.flags.ldspecs=
bmc_teensy41.menu.opt.oslto=Smallest Code with LTO
bmc_teensy41.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
bmc_teensy41.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

bmc_teensy41.menu.keys.en-us=US English
bmc_teensy41.menu.keys.en-us.build.keylayout=US_ENGLISH
bmc_teensy41.menu.keys.fr-ca=Canadian French
bmc_teensy41.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
bmc_teensy41.menu.keys.xx-ca=Canadian Multilingual
bmc_teensy41.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
bmc_teensy41.menu.keys.cz-cz=Czech
bmc_teensy41.menu.keys.cz-cz.build.keylayout=CZECH
bmc_teensy41.menu.keys.da-da=Danish
bmc_teensy41.menu.keys.da-da.build.keylayout=DANISH
bmc_teensy41.menu.keys.fi-fi=Finnish
bmc_teensy41.menu.keys.fi-fi.build.keylayout=FINNISH
bmc_teensy41.menu.keys.fr-fr=French
bmc_teensy41.menu.keys.fr-fr.build.keylayout=FRENCH
bmc_teensy41.menu.keys.fr-be=French Belgian
bmc_teensy41.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
bmc_teensy41.menu.keys.fr-ch=French Swiss
bmc_teensy41.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
bmc_teensy41.menu.keys.de-de=German
bmc_teensy41.menu.keys.de-de.build.keylayout=GERMAN
bmc_teensy41.menu.keys.de-dm=German (Mac)
bmc_teensy41.menu.keys.de-dm.build.keylayout=GERMAN_MAC
bmc_teensy41.menu.keys.de-ch=German Swiss
bmc_teensy41.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
bmc_teensy41.menu.keys.is-is=Icelandic
bmc_teensy41.menu.keys.is-is.build.keylayout=ICELANDIC
bmc_teensy41.menu.keys.en-ie=Irish
bmc_teensy41.menu.keys.en-ie.build.keylayout=IRISH
bmc_teensy41.menu.keys.it-it=Italian
bmc_teensy41.menu.keys.it-it.build.keylayout=ITALIAN
bmc_teensy41.menu.keys.no-no=Norwegian
bmc_teensy41.menu.keys.no-no.build.keylayout=NORWEGIAN
bmc_teensy41.menu.keys.pt-pt=Portuguese
bmc_teensy41.menu.keys.pt-pt.build.keylayout=PORTUGUESE
bmc_teensy41.menu.keys.pt-br=Portuguese Brazilian
bmc_teensy41.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
bmc_teensy41.menu.keys.rs-rs=Serbian (Latin Only)
bmc_teensy41.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
bmc_teensy41.menu.keys.es-es=Spanish
bmc_teensy41.menu.keys.es-es.build.keylayout=SPANISH
bmc_teensy41.menu.keys.es-mx=Spanish Latin America
bmc_teensy41.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
bmc_teensy41.menu.keys.sv-se=Swedish
bmc_teensy41.menu.keys.sv-se.build.keylayout=SWEDISH
bmc_teensy41.menu.keys.tr-tr=Turkish (partial)
bmc_teensy41.menu.keys.tr-tr.build.keylayout=TURKISH
bmc_teensy41.menu.keys.en-gb=United Kingdom
bmc_teensy41.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
bmc_teensy41.menu.keys.usint=US International
bmc_teensy41.menu.keys.usint.build.keylayout=US_INTERNATIONAL




bmc_teensyMM.name=Teensy MicroMod (BMC)
#bmc_teensyMM.upload.maximum_size=16515072
bmc_teensyMM.build.board=TEENSY_MICROMOD
bmc_teensyMM.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_mm.ld"
#bmc_teensyMM.upload.maximum_data_size=524288
#bmc_teensyMM.upload.maximum_data_size=1048576
bmc_teensyMM.upload.tool=teensy:teensyloader
bmc_teensyMM.upload.tool.default=teensy:teensyloader
bmc_teensyMM.upload.tool.teensy=teensy:teensyloader
bmc_teensyMM.upload.protocol=teensy
bmc_teensyMM.upload_port.modelID=0x26
bmc_teensyMM.build.core=teensy:teensy4
bmc_teensyMM.build.mcu=imxrt1062
bmc_teensyMM.build.warn_data_percentage=99
bmc_teensyMM.build.toolchain=arm/bin/
bmc_teensyMM.build.command.gcc=arm-none-eabi-gcc
bmc_teensyMM.build.command.g++=arm-none-eabi-g++
bmc_teensyMM.build.command.ar=arm-none-eabi-gcc-ar
bmc_teensyMM.build.command.objcopy=arm-none-eabi-objcopy
bmc_teensyMM.build.command.objdump=arm-none-eabi-objdump
bmc_teensyMM.build.command.linker=arm-none-eabi-gcc
bmc_teensyMM.build.command.size=arm-none-eabi-size
bmc_teensyMM.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
bmc_teensyMM.build.flags.dep=-MMD
bmc_teensyMM.build.flags.optimize=-Os
bmc_teensyMM.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
bmc_teensyMM.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159
bmc_teensyMM.build.flags.cpp=-std=gnu++17 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing -include "{build.source.path}/config.h"
bmc_teensyMM.build.flags.c=
bmc_teensyMM.build.flags.S=-x assembler-with-cpp
bmc_teensyMM.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
bmc_teensyMM.serial.restart_cmd=false
bmc_teensyMM.menu.usb.midi=MIDI
bmc_teensyMM.menu.usb.midi.build.usbtype=USB_MIDI
bmc_teensyMM.menu.usb.midi.upload_port.usbtype=USB_MIDI
bmc_teensyMM.menu.usb.midi.fake_serial=teensy_gateway
bmc_teensyMM.menu.usb.midi4=MIDIx4
bmc_teensyMM.menu.usb.midi4.build.usbtype=USB_MIDI4
bmc_teensyMM.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
bmc_teensyMM.menu.usb.midi4.fake_serial=teensy_gateway
bmc_teensyMM.menu.usb.midi16=MIDIx16
bmc_teensyMM.menu.usb.midi16.build.usbtype=USB_MIDI16
bmc_teensyMM.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
bmc_teensyMM.menu.usb.midi16.fake_serial=teensy_gateway
bmc_teensyMM.menu.usb.serialmidi=Serial + MIDI
bmc_teensyMM.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
bmc_teensyMM.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
bmc_teensyMM.menu.usb.serialmidi4=Serial + MIDIx4
bmc_teensyMM.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
bmc_teensyMM.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
bmc_teensyMM.menu.usb.serialmidi16=Serial + MIDIx16
bmc_teensyMM.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
bmc_teensyMM.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
bmc_teensyMM.menu.usb.serialmidiaudio=Serial + MIDI + Audio
bmc_teensyMM.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensyMM.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensyMM.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
bmc_teensyMM.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
bmc_teensyMM.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL

