neroroxxx/avr/boards.txt
bmc_teensy36.menu.opt.o2std=Faster
bmc_teensy36.menu.opt.o2std.build.flags.optimize=-O2
bmc_teensy36.menu.opt.o2std.build.flags.ldspecs=
bmc_teensy36.menu.opt.o2lto=Faster with LTO
bmc_teensy36.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
bmc_teensy36.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy36.menu.opt.o1std=Fast
bmc_teensy36.menu.opt.o1std.build.flags.optimize=-O1
bmc_teensy36.menu.opt.o1std.build.flags.ldspecs=
bmc_teensy36.menu.opt.o1lto=Fast with LTO
bmc_teensy36.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
bmc_teensy36.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy36.menu.opt.o3std=Fastest
bmc_teensy36.menu.opt.o3std.build.flags.optimize=-O3
bmc_teensy36.menu.opt.o3std.build.flags.ldspecs=
bmc_teensy36.menu.opt.o3purestd=Fastest + pure-code
bmc_teensy36.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
bmc_teensy36.menu.opt.o3purestd.build.flags.ldspecs=
bmc_teensy36.menu.opt.o3lto=Fastest with LTO
bmc_teensy36.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
bmc_teensy36.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy36.menu.opt.o3purelto=Fastest + pure-code with LTO
bmc_teensy36.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
bmc_teensy36.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy36.menu.opt.ogstd=Debug
bmc_teensy36.menu.opt.ogstd.build.flags.optimize=-Og
bmc_teensy36.menu.opt.ogstd.build.flags.ldspecs=
bmc_teensy36.menu.opt.oglto=Debug with LTO
bmc_teensy36.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
bmc_teensy36.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy36.menu.opt.osstd=Smallest Code
bmc_teensy36.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
bmc_teensy36.menu.opt.osstd.build.flags.ldspecs=
bmc_teensy36.menu.opt.oslto=Smallest Code with LTO
bmc_teensy36.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
bmc_teensy36.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

bmc_teensy36.menu.keys.en-us=US English
bmc_teensy36.menu.keys.en-us.build.keylayout=US_ENGLISH
bmc_teensy36.menu.keys.fr-ca=Canadian French
bmc_teensy36.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
bmc_teensy36.menu.keys.xx-ca=Canadian Multilingual
bmc_teensy36.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
bmc_teensy36.menu.keys.cz-cz=Czech
bmc_teensy36.menu.keys.cz-cz.build.keylayout=CZECH
bmc_teensy36.menu.keys.da-da=Danish
bmc_teensy36.menu.keys.da-da.build.keylayout=DANISH
bmc_teensy36.menu.keys.fi-fi=Finnish
bmc_teensy36.menu.keys.fi-fi.build.keylayout=FINNISH
bmc_teensy36.menu.keys.fr-fr=French
bmc_teensy36.menu.keys.fr-fr.build.keylayout=FRENCH
bmc_teensy36.menu.keys.fr-be=French Belgian
bmc_teensy36.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
bmc_teensy36.menu.keys.fr-ch=French Swiss
bmc_teensy36.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
bmc_teensy36.menu.keys.de-de=German
bmc_teensy36.menu.keys.de-de.build.keylayout=GERMAN
bmc_teensy36.menu.keys.de-dm=German (Mac)
bmc_teensy36.menu.keys.de-dm.build.keylayout=GERMAN_MAC
bmc_teensy36.menu.keys.de-ch=German Swiss
bmc_teensy36.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
bmc_teensy36.menu.keys.is-is=Icelandic
bmc_teensy36.menu.keys.is-is.build.keylayout=ICELANDIC
bmc_teensy36.menu.keys.en-ie=Irish
bmc_teensy36.menu.keys.en-ie.build.keylayout=IRISH
bmc_teensy36.menu.keys.it-it=Italian
bmc_teensy36.menu.keys.it-it.build.keylayout=ITALIAN
bmc_teensy36.menu.keys.no-no=Norwegian
bmc_teensy36.menu.keys.no-no.build.keylayout=NORWEGIAN
bmc_teensy36.menu.keys.pt-pt=Portuguese
bmc_teensy36.menu.keys.pt-pt.build.keylayout=PORTUGUESE
bmc_teensy36.menu.keys.pt-br=Portuguese Brazilian
bmc_teensy36.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
bmc_teensy36.menu.keys.rs-rs=Serbian (Latin Only)
bmc_teensy36.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
bmc_teensy36.menu.keys.es-es=Spanish
bmc_teensy36.menu.keys.es-es.build.keylayout=SPANISH
bmc_teensy36.menu.keys.es-mx=Spanish Latin America
bmc_teensy36.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
bmc_teensy36.menu.keys.sv-se=Swedish
bmc_teensy36.menu.keys.sv-se.build.keylayout=SWEDISH
bmc_teensy36.menu.keys.tr-tr=Turkish (partial)
bmc_teensy36.menu.keys.tr-tr.build.keylayout=TURKISH
bmc_teensy36.menu.keys.en-gb=United Kingdom
bmc_teensy36.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
bmc_teensy36.menu.keys.usint=US International
bmc_teensy36.menu.keys.usint.build.keylayout=US_INTERNATIONAL


bmc_teensy35.name=Teensy 3.5 (BMC)
bmc_teensy35.upload.maximum_size=524288
bmc_teensy35.upload.maximum_data_size=262136
bmc_teensy35.upload.tool=teensy:teensyloader
bmc_teensy35.upload.tool.default=teensy:teensyloader
bmc_teensy35.upload.tool.teensy=teensy:teensyloader
bmc_teensy35.upload.protocol=teensy
bmc_teensy35.upload_port.modelID=0x1F
bmc_teensy35.build.board=TEENSY35
bmc_teensy35.build.core=teensy:teensy3
bmc_teensy35.build.mcu=mk64fx512
bmc_teensy35.build.warn_data_percentage=98
bmc_teensy35.build.toolchain=arm/bin/
bmc_teensy35.build.command.gcc=arm-none-eabi-gcc
bmc_teensy35.build.command.g++=arm-none-eabi-g++
bmc_teensy35.build.command.ar=arm-none-eabi-gcc-ar
bmc_teensy35.build.command.objcopy=arm-none-eabi-objcopy
bmc_teensy35.build.command.objdump=arm-none-eabi-objdump
bmc_teensy35.build.command.linker=arm-none-eabi-gcc
bmc_teensy35.build.command.size=arm-none-eabi-size
bmc_teensy35.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib -mno-unaligned-access
bmc_teensy35.build.flags.dep=-MMD
bmc_teensy35.build.flags.optimize=-Os
bmc_teensy35.build.flags.cpu=-mthumb -mcpu=cortex-m4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -fsingle-precision-constant
bmc_teensy35.build.flags.defs=-D__MK64FX512__ -DTEENSYDUINO=159
bmc_teensy35.build.flags.cpp=-fno-exceptions -fpermissive -felide-constructors -std=gnu++17 -Wno-error=narrowing -fno-rtti -include "{build.source.path}/config.h"
bmc_teensy35.build.flags.c=
bmc_teensy35.build.flags.S=-x assembler-with-cpp
bmc_teensy35.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk64fx512.ld"
bmc_teensy35.build.flags.libs=-larm_cortexM4lf_math -lm -lstdc++
bmc_teensy35.serial.restart_cmd=false
bmc_teensy35.menu.usb.midi=MIDI
bmc_teensy35.menu.usb.midi.build.usbtype=USB_MIDI
bmc_teensy35.menu.usb.midi.upload_port.usbtype=USB_MIDI
bmc_teensy35.menu.usb.midi.fake_serial=teensy_gateway
bmc_teensy35.menu.usb.midi4=MIDIx4
bmc_teensy35.menu.usb.midi4.build.usbtype=USB_MIDI4
bmc_teensy35.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
bmc_teensy35.menu.usb.midi4.fake_serial=teensy_gateway
bmc_teensy35.menu.usb.midi16=MIDIx16
bmc_teensy35.menu.usb.midi16.build.usbtype=USB_MIDI16
bmc_teensy35.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
bmc_teensy35.menu.usb.midi16.fake_serial=teensy_gateway
bmc_teensy35.menu.usb.serialmidi=Serial + MIDI
bmc_teensy35.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
bmc_teensy35.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
bmc_teensy35.menu.usb.serialmidi4=Serial + MIDIx4
bmc_teensy35.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
bmc_teensy35.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
bmc_teensy35.menu.usb.serialmidi16=Serial + MIDIx16
bmc_teensy35.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
bmc_teensy35.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
bmc_teensy35.menu.usb.serialmidiaudio=Serial + MIDI + Audio
bmc_teensy35.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensy35.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
bmc_teensy35.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
bmc_teensy35.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
bmc_teensy35.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL

bmc_teensy35.menu.speed.120=120 MHz
bmc_teensy35.menu.speed.96=96 MHz
bmc_teensy35.menu.speed.72=72 MHz
bmc_teensy35.menu.speed.48=48 MHz
bmc_teensy35.menu.speed.24=24 MHz
bmc_teensy35.menu.speed.16=16 MHz (No USB)
bmc_teensy35.menu.speed.8=8 MHz (No USB)
bmc_teensy35.menu.speed.4=4 MHz (No USB)
bmc_teensy35.menu.speed.2=2 MHz (No USB)
bmc_teensy35.menu.speed.144=144 MHz (overclock)
bmc_teensy35.menu.speed.168=168 MHz (overclock)
bmc_teensy35.menu.speed.168.build.fcpu=168000000
bmc_teensy35.menu.speed.144.build.fcpu=144000000
bmc_teensy35.menu.speed.120.build.fcpu=120000000
bmc_teensy35.menu.speed.96.build.fcpu=96000000
bmc_teensy35.menu.speed.72.build.fcpu=72000000
bmc_teensy35.menu.speed.48.build.fcpu=48000000
bmc_teensy35.menu.speed.24.build.fcpu=24000000
bmc_teensy35.menu.speed.16.build.fcpu=16000000
bmc_teensy35.menu.speed.8.build.fcpu=8000000
bmc_teensy35.menu.speed.4.build.fcpu=4000000
bmc_teensy35.menu.speed.2.build.fcpu=2000000

bmc_teensy35.menu.opt.o2std=Faster
bmc_teensy35.menu.opt.o2std.build.flags.optimize=-O2
bmc_teensy35.menu.opt.o2std.build.flags.ldspecs=
bmc_teensy35.menu.opt.o2lto=Faster with LTO
bmc_teensy35.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
bmc_teensy35.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy35.menu.opt.o1std=Fast
bmc_teensy35.menu.opt.o1std.build.flags.optimize=-O1
bmc_teensy35.menu.opt.o1std.build.flags.ldspecs=
bmc_teensy35.menu.opt.o1lto=Fast with LTO
bmc_teensy35.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
bmc_teensy35.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy35.menu.opt.o3std=Fastest
bmc_teensy35.menu.opt.o3std.build.flags.optimize=-O3
bmc_teensy35.menu.opt.o3std.build.flags.ldspecs=
bmc_teensy35.menu.opt.o3purestd=Fastest + pure-code
bmc_teensy35.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
bmc_teensy35.menu.opt.o3purestd.build.flags.ldspecs=
bmc_teensy35.menu.opt.o3lto=Fastest with LTO
bmc_teensy35.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
bmc_teensy35.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy35.menu.opt.o3purelto=Fastest + pure-code with LTO
bmc_teensy35.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
bmc_teensy35.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy35.menu.opt.ogstd=Debug
bmc_teensy35.menu.opt.ogstd.build.flags.optimize=-Og
bmc_teensy35.menu.opt.ogstd.build.flags.ldspecs=
bmc_teensy35.menu.opt.oglto=Debug with LTO
bmc_teensy35.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
bmc_teensy35.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
bmc_teensy35.menu.opt.osstd=Smallest Code
bmc_teensy35.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
bmc_teensy35.menu.opt.osstd.build.flags.ldspecs=
bmc_teensy35.menu.opt.oslto=Smallest Code with LTO
bmc_teensy35.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
bmc_teensy35.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

