neroroxxx/avr/boards.txt
bmc_teensy31.menu.keys.en-us=US English
bmc_teensy31.menu.keys.en-us.build.keylayout=US_ENGLISH
bmc_teensy31.menu.keys.fr-ca=Canadian French
bmc_teensy31.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
bmc_teensy31.menu.keys.xx-ca=Canadian Multilingual
bmc_teensy31.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
bmc_teensy31.menu.keys.cz-cz=Czech
bmc_teensy31.menu.keys.cz-cz.build.keylayout=CZECH
bmc_teensy31.menu.keys.da-da=Danish
bmc_teensy31.menu.keys.da-da.build.keylayout=DANISH
bmc_teensy31.menu.keys.fi-fi=Finnish
bmc_teensy31.menu.keys.fi-fi.build.keylayout=FINNISH
bmc_teensy31.menu.keys.fr-fr=French
bmc_teensy31.menu.keys.fr-fr.build.keylayout=FRENCH
bmc_teensy31.menu.keys.fr-be=French Belgian
bmc_teensy31.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
bmc_teensy31.menu.keys.fr-ch=French Swiss
bmc_teensy31.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
bmc_teensy31.menu.keys.de-de=German
bmc_teensy31.menu.keys.de-de.build.keylayout=GERMAN
bmc_teensy31.menu.keys.de-dm=German (Mac)
bmc_teensy31.menu.keys.de-dm.build.keylayout=GERMAN_MAC
bmc_teensy31.menu.keys.de-ch=German Swiss
bmc_teensy31.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
bmc_teensy31.menu.keys.is-is=Icelandic
bmc_teensy31.menu.keys.is-is.build.keylayout=ICELANDIC
bmc_teensy31.menu.keys.en-ie=Irish
bmc_teensy31.menu.keys.en-ie.build.keylayout=IRISH
bmc_teensy31.menu.keys.it-it=Italian
bmc_teensy31.menu.keys.it-it.build.keylayout=ITALIAN
bmc_teensy31.menu.keys.no-no=Norwegian
bmc_teensy31.menu.keys.no-no.build.keylayout=NORWEGIAN
bmc_teensy31.menu.keys.pt-pt=Portuguese
bmc_teensy31.menu.keys.pt-pt.build.keylayout=PORTUGUESE
bmc_teensy31.menu.keys.pt-br=Portuguese Brazilian
bmc_teensy31.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
bmc_teensy31.menu.keys.rs-rs=Serbian (Latin Only)
bmc_teensy31.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
bmc_teensy31.menu.keys.es-es=Spanish
bmc_teensy31.menu.keys.es-es.build.keylayout=SPANISH
bmc_teensy31.menu.keys.es-mx=Spanish Latin America
bmc_teensy31.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
bmc_teensy31.menu.keys.sv-se=Swedish
bmc_teensy31.menu.keys.sv-se.build.keylayout=SWEDISH
bmc_teensy31.menu.keys.tr-tr=Turkish (partial)
bmc_teensy31.menu.keys.tr-tr.build.keylayout=TURKISH
bmc_teensy31.menu.keys.en-gb=United Kingdom
bmc_teensy31.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
bmc_teensy31.menu.keys.usint=US International
bmc_teensy31.menu.keys.usint.build.keylayout=US_INTERNATIONAL

bmc_teensy31.vid.0=0x16C0
bmc_teensy31.vid.1=0x16C0
bmc_teensy31.vid.2=0x16C0
bmc_teensy31.vid.3=0x16C0
bmc_teensy31.vid.4=0x16C0
bmc_teensy31.pid.0=0x0483
bmc_teensy31.pid.1=0x0487
bmc_teensy31.pid.2=0x0489
bmc_teensy31.pid.3=0x048A
bmc_teensy31.pid.4=0x0476